# def BOBER3000X(A,B):
#     C=A+B
#     return C
#     print("БОБЕЕЕЕЕЕЕЕЕР")
# print(BOBER3000X(A=100,B=201))
# A=BOBER3000X(A=3001,B=3002)
# BOBER3000X(A=1,B=10213123)
# def EX():
#     A=int(input("Введіть ширину Фігури"))
#     B=int(input("Введіть довжину прямокутника"))
#     C=A*B
#     print(C,"Квадратних сантиметрів або менрів вобшім я не знаю мене то не обходить")
#     G=(A+B)*2
#     print(G,"Сантиметрів-ваш переметер")
# EX()
# def Yaobiduvsia():
#     A=int(input("Введіть який зараз місяць"))
#     if A==1 or A==2:
#         print("Зима")
#     elif A==3 or A==4 or A==5:
#         print("Весна")
#     elif A==6 or A==7 or A==8:
#         print("УРРРРРРЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯЯ ЛІТОООООООООООООООООООООООООООООООООООООООООООООООООООО😎😎😎😎")
#     elif A==9 or A==10 or A==11:
#         print("НЕЕЕЕЕЕЕЕЕЕЕЕТ ОСІІІІІІІІІІННННННННННННННН УРОККИКИКИКИКИ😭😭😭😭😭😭😭💔💔💔🙀🙀😡😡😡")
#     elif A==12:
#         print("OPEN THE DOOR WINTER!!!!")
#     else:
#         print("Ну ти і боообееееееееррр🙁🙁🙁")
# Yaobiduvsia()
# A=input("Як ви хочете переводити гроші гривні в злоті чи злоті в гривні?")
# if A=="злоті в гривні":
#     B=int(input("Скільки злотих ви хочете перевести?"))
#     print(B*10)
#     X=B*10
#     print("Ви перевели",X,"гривень")
# elif A=="гривні в злоті":
#     C=int(input("Скільки гривень ви зочете перевести?"))
#     Z=C/10
#     print(C/10)
#     print("Ви перевели",Z,"злотих")
# def MEGAPAKA():
# #     A=int(input("Яке число ви хочете ввести?"))
# #     if A%2:
# #         print("Ваше не парне")
# #     elif A/2:
# #         print("Ваше число парне")
# # MEGAPAKA()
# def AY():
#     A=int(input("Яке число ви хочете ввести?"))
#     if A>0:
#         print("Ваше число позитивне")
#     elif A==0:
#         print("Ваше число дорівнює нулю")
#     elif A<0:
#         print("Ваше число негативне")
# AY()

